package edu.nwpu.pokemon.data;

import edu.nwpu.pokemon.System;
import edu.nwpu.pokemon.npc.Prop;
import edu.nwpu.pokemon.ui.DiaLogUI;

import java.awt.image.BufferedImage;


import javax.swing.JOptionPane;

import static edu.nwpu.pokemon.System.currentFloor;

/**
 * DialoguesBean 类
 * <p>
 * 对话类。存储游戏内的对话内容。
 *
 * @author 老毛桃
 */
public class Dialogue{

    private static int id;
    private static int count=0;

    public Dialogue(int id) {
        this.id = id;

        String[] messages;
        BufferedImage[] characters = new BufferedImage[50];
        int[] w = new int[50];
        int[] h = new int[50];
        for (int x = 0; x < 50; x++) {
            w[x] = 800;
            h[x] = 300;
        }
        for (int x = 0; x < characters.length; x++) {
            if (x % 2 == 0) {
                characters[x] = ImageData.playerMap1.get(-2);
            } else {
                characters[x] = System.imgSource.get(id);
            }
        }
        switch (this.id) {
            case 24:     // 第 0 层 仙子 第一次对话
                if( Prop.isHasCross==false&& currentFloor==0&& Prop.isHasBlueStick==false) {
                	
                	System.inConversation = true;
                	if(count == 0) {
                        messages = new String[]{
                                "......\n"
                                + "眼前一片黑\n"
                                + "......",
                                
                                "快醒醒!"
                                + "【路比】!\n"
                                + "快醒醒!!"
                                + "【路比】!!!",
                                
                                "......\n"
                                + "头有点晕\n"
                                + "......\n"
                                + "你是?\n"
                                + "这是什么地方?\n"
                                + "你怎么知道我的名字?",
                                
                                "我是这个世界的智慧仙子，"
                                + "通晓世界一切之理，"
                                + "我见证【艾欧尼亚】大陆所有的荣耀，"
                                + "也通晓这世上的所有的奥秘，"
                                + "却从来没有见过你这样的装扮。"
                                + "对你这样的存在没有半点头绪。"
                                + "这里是艾欧尼亚大陆上的【天柱】，"
                                + "至于你的名字嘛，"
                                + "刚刚从你身上找到了一张卡片。"
                                + "虽然很像是异国的文字，"
                                + "但我还是看懂了你的名字。"
                                + "嘛，毕竟是智慧仙子呀~",
                                
                                "......\n"
                                + "唔\n"
                                + "......\n"
                                + "你怎么可以不经过同意就拿别人东西?"
                                + "对了，"
                                + "先不说这个了，"
                                + "莎菲雅!"
                                + "莎菲雅!"
                                + "【莎菲雅】去哪里了？",
                                
                                "你冷静一点。"
                                + "好家伙，"
                                + "我救了你还这么说？"
                                + "还不是因为情况紧急我才拿了你的东西，"
                                + "还有你包里的果子挺好吃的。"
                                + "嘿嘿，"
                                + "咳咳。"
                                + "莎菲雅，"
                                + "什么莎菲雅？"
                                + "本仙子不知道，"
                                + "哼~",
                                
                                "那，"
                                + "妹妹呢？"
                                + "就那个女孩子，"
                                + "比我矮一点，"
                                + "你见到过吗？"
                                + "我刚刚不是还在和她一起出来买东西来着，"
                                + "你说什么什么尼亚大陆？？"
                                + "这里到底是什么鬼地方，"
                                + "我不是在便利店附近吗？"
                                + "是不是你把我妹妹带走了？"
                                + "你快还我妹妹！！",
                                
                                "啊这......."
                                + "不是吧，"
                                + "你清醒一点，"
                                + "是不是你的妹妹我不知道，"
                                + "确实有一个衣着一样奇怪的女孩子掉到了天柱里"
                                + "但是具体情报嘛。"
                                + "呵~"
                                + "这么无理，"
                                + "我现在不想告诉你，"
                                + "除非......",
                                
                                "除非什么除非?"
                                + "快把我妹妹还我！！！",
                                
                                "除非你能找到【精灵之匣】"
                                + "也许我可以......"
                                + "唔......"
                                + "给你......"
                                + "透露点情报，"
                                + "还能增强你的力量。" 
                                + "去去去，"
                                + "快去找东西，"
                                + "找到了再回来见我",
                                
                                "找东西？找什么东西？",
                                
                                "你有好好听吗？"
                                + "你有考虑过做说唱吗？"
                                + "告诉你了，"
                                + "去找【精灵之匣】",
                                
                                "那个东西有什么用吗？",
                                
                                "我本是这座塔守护者，"
                                + "可不久前，"
                                + "从北方来了一批宝可梦。" 
                                + "他们占领了这座天柱，"
                                + "并将我的魔力分裂存储在了三个【元素纹章】之中，"
                                + "分散到了天柱的三个地方" 
                                + "如果你能将元素纹章带出天柱来，"
                                + "那我的魔力便会慢慢地恢复" 
                                + "到那时........"
                                + "咳咳......."
                                + "也许........"
                                + "也许........"
                                + "我便可以把力量借给你"
                                + "你也可以去找你的莎菲雅了。"
                                + "说不定还能送你回什么什么利店。",
                                
                                ".......\n"
                                + "一头雾水\n"
                                + "......\n"
                                + "是便利店的说......"
                                + "好吧，"
                                + "我试试看。"
                                + "（小声嘀咕，"
                                + "这什么仙子，"
                                + "真的靠得住吗？）",
                                
                                " 据我所知，"
                                + "天柱里有一把英雄断剑，"
                                + "还有一个圣盾，"
                                + "但是具体在哪里我不清楚，"
                                + "也许......."
                                + "额......."
                                + "也许，"
                                + "根本就不存在吧。" 
                                + "第一个纹章应该被放在七楼。"
                                + "要到七楼，"
                                + "你得先找把剑再找个盾。"
                                + "另外在天柱里的其他楼层，"
                                + "还有一些存放了一些【雷之石】和【火之石】，"
                                + "如果取得了它们，"
                                + "对你对付天柱里的宝可梦将有很大帮助。",
                                
                                "......\n"
                                + "可是，"
                                + "这儿有门挡着，"
                                + "我怎么进去呢?",
                                
                                "我这里有一个精灵球、"
                                + "一个大师球、"
                                + "一个超级球，"
                                + "每个球里都存放着一把钥匙。"
                                + "你先拿去，"
                                + "天柱里面还有很多这样的球。"
                                + "你一定要珍惜使用。"
                                + "去吧，"
                                + "去吧。"
                                + "愿苍蓝星指引你的方向。"
                                + "希望你活着回来。"
                        };
                	}
                	else {
                		messages = new String[] {
                				"......",
                				
                				"快去吧。路比。"
                				+ "愿苍蓝星指引你的方向。"
                		};
                	}
                    Map.LvMap[currentFloor][8][5] = 0;
                    Map.LvMap[currentFloor][8][4] = 24;
                    if(count==0) {
                        System.playerBean_1.setRkey(System.playerBean_1.getRkey()+1);
                        System.playerBean_1.setYkey(System.playerBean_1.getYkey()+1);
                        System.playerBean_1.setBkey(System.playerBean_1.getBkey()+1);
                    }
                    count = 1;
                }
                else if( Prop.isHasCross==true&& currentFloor==0&& Prop.isHasBlueStick==false)
                {
                    if(count == 1) {
                    	messages = new String[]{
                                "智慧仙子，我找到【精灵徽章】了。",
                                
                                "Good Job!\n"
                                + "那么现在我就借给你更强的力量！\n"
                                + "《概率论与数理统计》······\n"
                                + "《大学物理》.......\n"
                                + "《软件工程导论》......\n"
                                + "......\n"
                                + "好了，我已经将你现在的能力提升了！\n"
                        };
                        System.playerBean_1.setHp(System.playerBean_1.getHp() * 4 / 3);
                        System.playerBean_1.setAttack(System.playerBean_1.getAttack() * 4 / 3);
                        System.playerBean_1.setDefend(System.playerBean_1.getDefend() * 4 / 3);
                        Map.LvMap[0][8][4] = 24;
                    }else {
                    	messages = new String[] {
                    			"......",
                    			
                    			"我已经将你现在的能力提升了，\n"
                    			+ "踏上新的征程吧，愿苍蓝星指引你的方向！"
                    	};
                    }
                    count = 2;
                }
                else if( Prop.isHasBlueStick==true) {
                    messages = new String[]{
                            "智慧仙子！你看这是什么！",
                            
                            "嗯？！你手里的那个东西是什么？",
                            
                            "这个？"+
                            "这是一个老人交给我的，"+
                            "是他叫我带它来找你的，"+
                            "他说你知道它的来历和作用。",
                            
                            "这个东西就是我说的【水之纹章】，" +
                            "这就是我被分裂的力量的一部分。\n" +
                            "元素纹章一共有三个，" +
                            "分别镶着火焰、叶子、水滴三种形状的宝石。\n" +
                            "你现在拿着的是一颗镶有水滴宝石的【水之纹章】，" +
                            "应该还有一个镶着叶子宝石的【草之纹章】，"+
                            "和镶着火焰宝石的【火之纹章】。\n" +
                            "在这座天柱的下面，"+
                            "封印着一只世界的守护神兽，"+
                            "名叫【裂空座】。\n" +
                            "本来裂空座是天柱的主人，"+
                            "守护着艾欧尼亚大陆北方的一方净土。"+
                            "艾欧尼亚本来是一个宝可梦和人类友好相处的大陆，"+
                            "人类与宝可梦相互帮助，"+
                            "一起生活。"+
                            "可是不知道怎么回事，"+
                            "四百年前，"+
                            "裂空座突然性情大变，"+
                            "连艾欧尼亚大陆北方的所有宝可梦都被影响，"+
                            "它们开始向天柱迁移，"+
                            "在天柱聚集，"+
                            "甚至打伤了天柱附近的居民。"+
                            "艾欧尼亚大陆的国王接到了裂空座暴走的消息，"+
                            "国王心急如焚，"+
                            "发动了北方的【凌风骑士团】前去镇压裂空座。"+
                            "可是人类哪里会是宝可梦的对手，"+
                            "更何况是昔日守卫天柱的守护神兽裂空座。"+
                            "国王的凌风骑士团勉强转移了天柱附近的居民，"+
                            "骑士团损失惨重，"+
                            "整个骑士团在与天灾般的战斗中损失了八成的战士，"+
                            "所以你在天柱中随处可以捡到的钢剑和盾牌几乎都是四百年大战的遗物。"+
                            "那场大战十分惨烈，"+
                            "平日温顺的宝可梦转眼就变成了不受控制的魔兽，"+
                            "我也在这场大战中被夺取了力量，"+
                            "眼看着骑士团就快要被打败了，"+
                            "迫不得已，"+
                            "国王开始向整个大陆征召勇士去讨伐裂空座，"+
                            "可是人类还是难敌宝可梦，"+
                            "应征而来的勇士们还是被杀得片甲不留，"+
                            "艾欧尼亚大陆的毁灭似乎已然成为定局。"+
                            "在一个满月的夜晚，"+
                            "世界的缔造者【阿尔宙斯】来到国王的城堡，"+
                            "降下了一块石板。"+
                            "用这块石板，"+
                            "国王请艾欧尼亚最出名的铁匠打造了一把圣剑，"+
                            "剑的真名为【胜利-誓约之剑】。"+
                            "骑士团的英雄，"+
                            "艾尔文团长，"+
                            "举起了圣剑，"+
                            "孤身一人重返天柱，"+
                            "拼死将暴动的裂空座封印了起来，"+
                            "而他却永远消失在了封印的巨大冲击波里，"+
                            "圣剑也因此下落不明。"+
                            "天柱附近暂时恢复了太平，"+
                            "但是最近封印的力量又开始减弱了。"+
                            "你能取得【水之纹章】，"+
                            "说不定......"+
                            "不会错的!"+
                            "能在天柱中活着取得【水之纹章】的异乡人啊，"+
                            "请你继续前进吧！"+
                            "是你的话，"+
                            "一定可以找到传说中的圣剑，"+
                            "重新封印裂空座！"+
                            "也许这就是你来到这个世界的理由吧！",
                            
                            "唔......"
                            + "好像背负上了不得了的使命啊。"
                            + "我会做到的！"
                            + "对啊，"
                            + "也许这样我就能回到原来的世界了。"
                            + "要等着我啊，"
                            + "莎菲雅！",
                            
                            "每一个元素纹章里都有很强的魔力，" +
	                        "如果被宝可梦得到了将会使它的力量倍增。\n" +
	                        "如果被恶魔将它们三个找齐的话。\n" +
	                        "那么裂空座的封印便会解除！\n" +
	                        "艾欧尼亚大陆就真的要覆灭了！"+
	                        "路比，你还是快去把我的元素纹章找来吧！"
	                        + "等我恢复了魔力，" +
	                        "我就可以帮你将元素纹章中的魔力都释放出来！\n" +
	                        "我就可以借给你我的全部力量！"
	                        + "愿苍蓝星指引你的方向！"

                    };
                    Map.LvMap[currentFloor][8][4] = 0;
                }
                else messages=null;
                DiaLogUI.talk(messages, characters, w, h);
                break;
            case 26:     //  神秘老人
                if(System.playerBean_1.getExp()<500&& currentFloor==15)
                    messages = new String[]{
                            "......",
                            "嘿嘿，"
                            + "终于见到活人了。\n" +
                            "我将给你一把非常好的剑，"
                            + "它可以使你的攻击" +
                            "力提升 120 点，"
                            + "但这必须得用你的 500 点经验" +
                            "来进行交换，"
                            + "考虑一下子吧！",
                            "这......"
                            + "可我现在还没有那么多的经验。",
                            "那等你的经验够了，"
                            + "想要的时候再来吧！"
                    };
                else if(System.playerBean_1.getExp()>=500&& currentFloor==15)
                { messages = new String[]{
                        "......",
                        
                        "嘿嘿，终于见到活人了。\n" +
                        "我将给你一把非常好的剑，"
                        + "它可以使你的攻击" +
                        "力提升 120 点，"
                        + "但这必须得用你的 500 点经验" +
                        "来进行交换，"
                        + "考虑一下子吧！",
                        
                        "好吧，那就把剑给我。",
                        
                        "这把剑就给你了！"
                        + "呵呵，"
                        + "这样一来就解脱了，"
                        + "呵呵~",
                        
                        "！！！\n"
                        + "（一阵凉风吹过）"
                    };
                    System.playerBean_1.setExp(System.playerBean_1.getExp()-500);
                    System.playerBean_1.setAttack(System.playerBean_1.getAttack()+120);
                    Map.LvMap[currentFloor][3][4] = 0;
                }
                else if(currentFloor==16) {
                    messages = new String[]{
                            "......",
                            
                            "啊！是艾尔文团长！",
                            
                            "额......"
                            + "我不是团长，"
                            + "您怎么了？",
                            
                            "咳咳......"
                            + "团长，"
                            + "我快不行了。"
                            + "我已经快封不住它了，"
                            + "团长，"
                            + "请你将这个东西交给智慧仙子，"
                            + "她会告诉你这是什么东西，"
                            + "有什么用的！\n"
                            + "快去吧，"
                            + "再迟就来不及了！"
                            + "咳咳......"
                            + "我快不......"
                            + "行......",
                            
                            "！！！\n"
                            + "（一阵凉风吹过）"
                    };
                     Prop.isHasBlueStick=true;
                    Map.LvMap[currentFloor][4][4] = 0;
                }
                else if(currentFloor==13) {
                    messages = new String[]{
                            "......",
                            
                            "啊，"
                            + "是个鲜活的生命~",
                            
                            "！！！"
                            + "离我远点！"
                            + "再过来我就动手了！",
                            
                            "放轻松，"
                            + "呵呵，"
                            + "我在学习《面向对象编程与设计》。"
                            + "已经四百年了，"
                            + "当时被困在这个天柱里身上就只剩下了这本书，"
                            + "呵呵，"
                            + "这是我积累的经验。\n"
                            + "这样一来就解脱了，"
                            + "呵呵~",
                            
                            "！！！\n"
                            + "（一阵凉风吹过）"
                    };
                    System.playerBean_1.setExp(System.playerBean_1.getExp()+50);
                    Map.LvMap[currentFloor][6][4] = 0;
                }
                else if(currentFloor==2) {
                    messages = new String[]{
                            "您已经得救了！",
                            
                            "呵呵~"
                            + "我的阿尔宙斯啊！"
                            + "真是太感谢你了！" +
                            "这个地方又脏又坏，"
                            + "我真的是快呆不下去了。",
                            
                            "快走吧，我还得去找我的妹妹。",
                            
                            "哦~"
                            + "你是来找妹妹的，"
                            + "呵呵~"
                            + "为了表示对你的感谢，"
                            + "这把剑就送给你吧，" +
                            "这还是我四百年前的时候用过的。" +
                            "带上它去寻找你的妹妹吧！"
                            + "呵呵~"
                            + "这一来就解脱了呢~",
                            
                            "！！！\n"
                            + "（一阵凉风吹过）"
                    };
                    System.playerBean_1.setAttack(System.playerBean_1.getAttack()+30);;
                    Map.LvMap[currentFloor][10][7] = 0;
                }
                else if(currentFloor==5) {
                    messages = new String[]{
                            "......",
                            
                            "啊，"
                            + "是个鲜活的生命~",
                            
                            "！！！"
                            + "离我远点！"
                            + "再过来我就动手了！",
                            
                            "放轻松，"
                            + "呵呵，"
                            + "我在学习《软件工程导论》。"
                            + "已经四百年了，"
                            + "当时被困在这个天柱里身上就只剩下了这本书，"
                            + "呵呵，"
                            + "这是我积累的经验。\n"
                            + "这样一来就解脱了，"
                            + "呵呵~",
                            
                            "！！！\n"
                            + "（一阵凉风吹过）"
                    };
                    System.playerBean_1.setExp(System.playerBean_1.getExp()+50);
                    Map.LvMap[currentFloor][7][1] = 0;
                }
                else messages=null;
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);

                break;



            case 27:     //  商人
                if(currentFloor==2)     {
                    messages = new String[]{
                            "您已经得救了！",
                            
                            "真是太感谢你了！"+
                            "我是个商人，"
                            + "本来想到天柱这里发点小财。\n"
                            + "没想到反而被困住了。",
                            
                            "快走吧，"
                            + "现在你连头发都是自由的。",
                            
                            "哦，"
                            + "对对对，"
                            + "我已经免费了。\n" +
                            "那这个东西就给你吧，"
                            + "本来我是准备卖钱的。\n" +
                            "相信它对你一定很有帮助！"
                    };
                    System.playerBean_1.setDefend(System.playerBean_1.getDefend()+5);
                    Map.LvMap[currentFloor][10][9] = 0;
                }
                else if(currentFloor==5) {
                    messages = new String[]{
                            "您已经得救了！",
                            
                            "真是太感谢你了！"+
                            "我是个商人，"
                            + "本来想到天柱这里发点小财。\n"
                            + "没想到反而被困住了。",
                            
                            "快走吧，"
                            + "现在你连头发都是自由的。",
                            
                            "哦，"
                            + "对对对，"
                            + "我已经免费了。\n" +
                            "那这个东西就给你吧，"
                            + "本来我是准备卖钱的。\n" +
                            "相信它对你一定很有帮助！"
                    };
                    System.playerBean_1.setDefend(System.playerBean_1.getDefend()+5);
                        Map.LvMap[currentFloor][3][10] = 0;
                }
                else if(currentFloor==12) {
                    messages = new String[]{
                            "您已经得救了！",
                            
                            "真是太感谢你了！"+
                            "我是个商人，"
                            + "本来想到天柱这里发点小财。\n"
                            + "没想到反而被困住了。",
                            
                            "快走吧，"
                            + "现在你连头发都是自由的。",
                            
                            "哦，"
                            + "对对对，"
                            + "我已经免费了。\n" +
                            "那这个东西就给你吧，"
                            + "本来我是准备卖钱的。\n" +
                            "相信它对你一定很有帮助！"
                    };
                    System.playerBean_1.setDefend(System.playerBean_1.getDefend()+5);
                    Map.LvMap[currentFloor][0][0] = 0;
                }
                else if(currentFloor==15&&System.playerBean_1.getMoney()<500) {
                    messages = new String[]{
                            "......",
                            
                            "嘿嘿，"
                            + "终于见到活人了。\n" +
                            "这可是传说的盾牌，"
                            + "它可以使你的防御力" +
                            "提升120点，"
                            + "但这必须得用你的 500金币" +
                            "来进行交换，"
                            + "考虑一下子吧！",
                            "这......"
                            + "可我现在还没有那么多的金币。",
                            "那等你的钱够了，"
                            + "想要的时候再来吧！"
                    };
                }
                else if(currentFloor==15&&System.playerBean_1.getMoney()>=500) {
                    messages = new String[]{
                            "......",
                            
                            "嘿嘿，"
                            + "终于见到活人了。\n" +
                            "这可是传说的盾牌，"
                            + "它可以使你的防御力" +
                            "提升120点，"
                            + "但这必须得用你的 500金币" +
                            "来进行交换，"
                            + "考虑一下子吧！",
                            "这......"
                            + "有点贵啊。",
                            "一分钱一分货，"
                            + "我从不做违心买卖！",
                            
                            "那好吧，"
                            + "成交！",
                            
                            "呵呵，"
                            + "这样一来就解脱了，"
                            + "呵呵~",
                            
                            "！！！\n"
                            + "（一阵凉风吹过）"
                    };
                    System.playerBean_1.setMoney(System.playerBean_1.getMoney()-500);
                    System.playerBean_1.setDefend(System.playerBean_1.getDefend()+120);
                    Map.LvMap[currentFloor][3][6] = 0;
                }

                else messages=null;
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);

                break;

            case 25:    //  小偷
                if(currentFloor==4&& Prop.isHasHammer == false) {
                    messages = new String[]{
                            "你已经得救了! ",
                            
                            "啊，"
                            + "那真是太好了，"
                            + "我又可以在这里面寻宝了！\n" +
                            "哦，"
                            + "还没有自我介绍，"
                            + "我叫杰克，"
                            + "是这附近有名的冒险家，" +
                            "什么古墓、迷宫我都闯过，"
                            + "什么金银财宝我样样都见过。\n" +
                            "不过这次运气不太好，"
                            + "刚进来就被宝可梦抓住了。\n" +
                            "现在你帮我打开了门，"
                            + "那我就答应你做一件事吧。",
                            
                            "快走吧，"
                            + "外面还有很多宝可梦，"
                            + "我可能顾不上你。",
                            
                            "不，不，不会有事的。\n"
                            + "快说吧，"
                            + "有什么冒险家可以帮忙的？",
                            
                            "额······\n"
                            + "那......"
                            + "你会开门吗？",
                            
                            "那当然。",
                            
                            "那就请你帮我打开第二层的门吧！",
                            "那个简单，"
                            + "不过，"
                            + "如果你能帮我找到一把嵌了红" +
                            "宝石的铁榔头的话，"
                            + "我还帮你打通第十八层的路。",
                            
                            "嵌了红宝石的铁榔头？"
                            + "好吧，"
                            + "我帮你找找。",
                            
                            "非常地感谢。"
                            + "一会我便会将第二层的门打开。" +
                            "如果你找到那个铁榔头的话，"
                            + "还是来这里找我！"
                    };
                    Map.LvMap[2][6][1] = 0;
                }
                else if(currentFloor==4&& Prop.isHasHammer == true) {

                    messages = new String[]{
                            "哈，"
                            + "快看，"
                            + "我找到了什么！",
                            
                            "太好了，"
                            + "这个东西果然是在这里。\n" +
                            "好吧，"
                            + "我这就去帮你打通第十八层的路。"
                    };
                    Map.LvMap[currentFloor][0][5] = 0;
                    Map.LvMap[18][8][5] = 0;
                    Map.LvMap[18][9][5] = 0;
                }
                else messages=null;
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);
                break;
            case 28:
                messages = new String[]{
                        "莎菲雅！"
                        + "是莎菲雅吗？",
                        
                        "这个声音是......",
                        
                        "莎菲雅！"
                        + "是莎菲雅吗？",
                        
                        "是路比！！！\n"
                        + "路比！！！",
                        
                        "太好了，"
                        + "没受伤吧。",
                        
                        "没有，"
                        + "我好着呢。\n"
                        + "（抽泣声）",
                        
                        "嘿嘿，"
                        + "没事就好，"
                        + "我还指望你帮我写《软件开发基础能力训练》的作业呢！",
                        
                        "?\n"
                        + "哼~哼~\n"
                        + "啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊！！！！！！",
                        
                        "好了好了，"
                        + "开玩笑的，"
                        + "现在外面还很危险，"
                        + "还有很多宝可梦。"
                        + "你就在此地，"
                        + "不要走动。"
                        + "等我去封印了暴动的裂空座，"
                        + "我们就可以回家了。",
                        
                        "不嘛~"
                        + "我要和哥哥一起走。",
                        
                        "乖（摸头），"
                        + "听话，你就在这里等着我。",
                        
                        "那你一定要小心啊，"
                        + "唔......",
                        
                        "放心吧，"
                        + "莎菲雅。"
                };

                Map.LvMap[18][10][9] = 8;
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);
                break;

            case 13:    // 第 16 层 魔王对话
                messages = new String[]{
                        "······",
                        
                        "啊！"
                        + "是鲜活的生命！"
                        + "是跳动的心脏！"
                        + "是青春的血液！",
                        
                        "恶心心！"
                        + "就是你在搞鬼是吧？"
                        + "导致裂空座暴动的也是你是吧？"
                        + "抓走我妹妹的也是你是吧？"
                        + "快说！我妹妹在哪里？",
                        
                        "嘿嘿~"
                        + "谢谢款待！"
                };
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);
                break;
            case 59:
                if(System.playerBean_1.getPosX() == 5 && System.playerBean_1.getPosY() == 9) {
                    messages = new String[]{
                            "裂空座！"
                            + "快醒醒！",
                            
                            "嗷呜······！\n"
                            + "噶可基多卡嘶.......!\n",
                            
                            "快醒醒！"
                            + "艾欧尼亚大陆的荣光，"
                            + "人与宝可梦的和谐，"
                            + "难道你都忘了吗？",
                            
                            "噶可基多卡嘶.......!\\n"
                            + "咯托拉......!",
                            
                            "不行完全没有办法和裂空座沟通！" +
                            "看来必须要战斗了！！！\n" +
                            "要上了！裂空座！"

                    };
                }
                else
                    messages = null;
                h[9] = 220;
                h[13] = 400;
                h[15] = 380;
                h[17] = 200;
                DiaLogUI.talk(messages, characters, w, h);
                break;
            case 198:
                if(System.playerBean_1.getPosX()==5&&System.playerBean_1.getPosY()==4) {
                    System.inConversation = true;
                    JOptionPane.showMessageDialog(System.gameFrame, "恭喜通关！您的通关时间是：" + System.gameMin + " 分, " + (int) System.gameSec + " 秒");
                    Map.LvMap[26][1][4] = 0;
                    Map.LvMap[26][1][5] = 0;
                    Map.LvMap[26][1][6] = 0;
                    Map.LvMap[26][2][4] = 0;
                    Map.LvMap[26][2][5] = 0;
                    Map.LvMap[26][2][6] = 0;
                    Map.LvMap[26][3][4] = 0;
                    Map.LvMap[26][3][6] = 0;
                }
        }
    }
}
